Revit 2027 API
BuiltInFailures.GridChainSketchFailures.MoreThanOneLoop Property
 GridChain sketch contains more than one loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MoreThanOneLoop { get; }
Public Shared ReadOnly Property MoreThanOneLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MoreThanOneLoop {
	FailureDefinitionId^ get ();
}
static member MoreThanOneLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GridChainSketchFailures Class
Autodesk.Revit.DB Namespace